Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/secumod.h
/*
 * Component description for SECUMOD
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-24T14:43:55Z */
#ifndef _SAMA5D2_SECUMOD_COMPONENT_H_
#define _SAMA5D2_SECUMOD_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SECUMOD                                      */
/* ************************************************************************** */

/* -------- SECUMOD_CR : (SECUMOD Offset: 0x00) ( /W 32) Control Register -------- */
#define SECUMOD_CR_BACKUP_Pos                 _UINT32_(0)                                          /* (SECUMOD_CR) Backup Mode Position */
#define SECUMOD_CR_BACKUP_Msk                 (_UINT32_(0x1) << SECUMOD_CR_BACKUP_Pos)             /* (SECUMOD_CR) Backup Mode Mask */
#define SECUMOD_CR_BACKUP(value)              (SECUMOD_CR_BACKUP_Msk & (_UINT32_(value) << SECUMOD_CR_BACKUP_Pos)) /* Assigment of value for BACKUP in the SECUMOD_CR register */
#define SECUMOD_CR_NORMAL_Pos                 _UINT32_(1)                                          /* (SECUMOD_CR) Normal Mode Position */
#define SECUMOD_CR_NORMAL_Msk                 (_UINT32_(0x1) << SECUMOD_CR_NORMAL_Pos)             /* (SECUMOD_CR) Normal Mode Mask */
#define SECUMOD_CR_NORMAL(value)              (SECUMOD_CR_NORMAL_Msk & (_UINT32_(value) << SECUMOD_CR_NORMAL_Pos)) /* Assigment of value for NORMAL in the SECUMOD_CR register */
#define SECUMOD_CR_SWPROT_Pos                 _UINT32_(2)                                          /* (SECUMOD_CR) Software Protection Position */
#define SECUMOD_CR_SWPROT_Msk                 (_UINT32_(0x1) << SECUMOD_CR_SWPROT_Pos)             /* (SECUMOD_CR) Software Protection Mask */
#define SECUMOD_CR_SWPROT(value)              (SECUMOD_CR_SWPROT_Msk & (_UINT32_(value) << SECUMOD_CR_SWPROT_Pos)) /* Assigment of value for SWPROT in the SECUMOD_CR register */
#define SECUMOD_CR_SCRAMB_Pos                 _UINT32_(9)                                          /* (SECUMOD_CR) Memory Scrambling Enable Position */
#define SECUMOD_CR_SCRAMB_Msk                 (_UINT32_(0x3) << SECUMOD_CR_SCRAMB_Pos)             /* (SECUMOD_CR) Memory Scrambling Enable Mask */
#define SECUMOD_CR_SCRAMB(value)              (SECUMOD_CR_SCRAMB_Msk & (_UINT32_(value) << SECUMOD_CR_SCRAMB_Pos)) /* Assigment of value for SCRAMB in the SECUMOD_CR register */
#define SECUMOD_CR_KEY_Pos                    _UINT32_(16)                                         /* (SECUMOD_CR) Password Position */
#define SECUMOD_CR_KEY_Msk                    (_UINT32_(0xFFFF) << SECUMOD_CR_KEY_Pos)             /* (SECUMOD_CR) Password Mask */
#define SECUMOD_CR_KEY(value)                 (SECUMOD_CR_KEY_Msk & (_UINT32_(value) << SECUMOD_CR_KEY_Pos)) /* Assigment of value for KEY in the SECUMOD_CR register */
#define SECUMOD_CR_Msk                        _UINT32_(0xFFFF0607)                                 /* (SECUMOD_CR) Register Mask  */


/* -------- SECUMOD_SYSR : (SECUMOD Offset: 0x04) (R/W 32) System Status Register -------- */
#define SECUMOD_SYSR_ERASE_DONE_Pos           _UINT32_(0)                                          /* (SECUMOD_SYSR) Erasable Memories State (RW) Position */
#define SECUMOD_SYSR_ERASE_DONE_Msk           (_UINT32_(0x1) << SECUMOD_SYSR_ERASE_DONE_Pos)       /* (SECUMOD_SYSR) Erasable Memories State (RW) Mask */
#define SECUMOD_SYSR_ERASE_DONE(value)        (SECUMOD_SYSR_ERASE_DONE_Msk & (_UINT32_(value) << SECUMOD_SYSR_ERASE_DONE_Pos)) /* Assigment of value for ERASE_DONE in the SECUMOD_SYSR register */
#define SECUMOD_SYSR_ERASE_ON_Pos             _UINT32_(1)                                          /* (SECUMOD_SYSR) Erase Process Ongoing (RO) Position */
#define SECUMOD_SYSR_ERASE_ON_Msk             (_UINT32_(0x1) << SECUMOD_SYSR_ERASE_ON_Pos)         /* (SECUMOD_SYSR) Erase Process Ongoing (RO) Mask */
#define SECUMOD_SYSR_ERASE_ON(value)          (SECUMOD_SYSR_ERASE_ON_Msk & (_UINT32_(value) << SECUMOD_SYSR_ERASE_ON_Pos)) /* Assigment of value for ERASE_ON in the SECUMOD_SYSR register */
#define SECUMOD_SYSR_BACKUP_Pos               _UINT32_(2)                                          /* (SECUMOD_SYSR) Backup Mode (RO) Position */
#define SECUMOD_SYSR_BACKUP_Msk               (_UINT32_(0x1) << SECUMOD_SYSR_BACKUP_Pos)           /* (SECUMOD_SYSR) Backup Mode (RO) Mask */
#define SECUMOD_SYSR_BACKUP(value)            (SECUMOD_SYSR_BACKUP_Msk & (_UINT32_(value) << SECUMOD_SYSR_BACKUP_Pos)) /* Assigment of value for BACKUP in the SECUMOD_SYSR register */
#define SECUMOD_SYSR_SWKUP_Pos                _UINT32_(3)                                          /* (SECUMOD_SYSR) SWKUP State (RO) Position */
#define SECUMOD_SYSR_SWKUP_Msk                (_UINT32_(0x1) << SECUMOD_SYSR_SWKUP_Pos)            /* (SECUMOD_SYSR) SWKUP State (RO) Mask */
#define SECUMOD_SYSR_SWKUP(value)             (SECUMOD_SYSR_SWKUP_Msk & (_UINT32_(value) << SECUMOD_SYSR_SWKUP_Pos)) /* Assigment of value for SWKUP in the SECUMOD_SYSR register */
#define SECUMOD_SYSR_AUTOBKP_Pos              _UINT32_(6)                                          /* (SECUMOD_SYSR) Automatic Backup Mode Enabled (RO) Position */
#define SECUMOD_SYSR_AUTOBKP_Msk              (_UINT32_(0x1) << SECUMOD_SYSR_AUTOBKP_Pos)          /* (SECUMOD_SYSR) Automatic Backup Mode Enabled (RO) Mask */
#define SECUMOD_SYSR_AUTOBKP(value)           (SECUMOD_SYSR_AUTOBKP_Msk & (_UINT32_(value) << SECUMOD_SYSR_AUTOBKP_Pos)) /* Assigment of value for AUTOBKP in the SECUMOD_SYSR register */
#define SECUMOD_SYSR_SCRAMB_Pos               _UINT32_(7)                                          /* (SECUMOD_SYSR) Scrambling Enabled (RO) Position */
#define SECUMOD_SYSR_SCRAMB_Msk               (_UINT32_(0x1) << SECUMOD_SYSR_SCRAMB_Pos)           /* (SECUMOD_SYSR) Scrambling Enabled (RO) Mask */
#define SECUMOD_SYSR_SCRAMB(value)            (SECUMOD_SYSR_SCRAMB_Msk & (_UINT32_(value) << SECUMOD_SYSR_SCRAMB_Pos)) /* Assigment of value for SCRAMB in the SECUMOD_SYSR register */
#define SECUMOD_SYSR_Msk                      _UINT32_(0x000000CF)                                 /* (SECUMOD_SYSR) Register Mask  */


/* -------- SECUMOD_SR : (SECUMOD Offset: 0x08) ( R/ 32) Status Register -------- */
#define SECUMOD_SR_DET0_Pos                   _UINT32_(16)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET0_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET0_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET0(value)                (SECUMOD_SR_DET0_Msk & (_UINT32_(value) << SECUMOD_SR_DET0_Pos)) /* Assigment of value for DET0 in the SECUMOD_SR register */
#define SECUMOD_SR_DET1_Pos                   _UINT32_(17)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET1_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET1_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET1(value)                (SECUMOD_SR_DET1_Msk & (_UINT32_(value) << SECUMOD_SR_DET1_Pos)) /* Assigment of value for DET1 in the SECUMOD_SR register */
#define SECUMOD_SR_DET2_Pos                   _UINT32_(18)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET2_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET2_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET2(value)                (SECUMOD_SR_DET2_Msk & (_UINT32_(value) << SECUMOD_SR_DET2_Pos)) /* Assigment of value for DET2 in the SECUMOD_SR register */
#define SECUMOD_SR_DET3_Pos                   _UINT32_(19)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET3_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET3_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET3(value)                (SECUMOD_SR_DET3_Msk & (_UINT32_(value) << SECUMOD_SR_DET3_Pos)) /* Assigment of value for DET3 in the SECUMOD_SR register */
#define SECUMOD_SR_DET4_Pos                   _UINT32_(20)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET4_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET4_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET4(value)                (SECUMOD_SR_DET4_Msk & (_UINT32_(value) << SECUMOD_SR_DET4_Pos)) /* Assigment of value for DET4 in the SECUMOD_SR register */
#define SECUMOD_SR_DET5_Pos                   _UINT32_(21)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET5_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET5_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET5(value)                (SECUMOD_SR_DET5_Msk & (_UINT32_(value) << SECUMOD_SR_DET5_Pos)) /* Assigment of value for DET5 in the SECUMOD_SR register */
#define SECUMOD_SR_DET6_Pos                   _UINT32_(22)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET6_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET6_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET6(value)                (SECUMOD_SR_DET6_Msk & (_UINT32_(value) << SECUMOD_SR_DET6_Pos)) /* Assigment of value for DET6 in the SECUMOD_SR register */
#define SECUMOD_SR_DET7_Pos                   _UINT32_(23)                                         /* (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET7_Msk                   (_UINT32_(0x1) << SECUMOD_SR_DET7_Pos)               /* (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET7(value)                (SECUMOD_SR_DET7_Msk & (_UINT32_(value) << SECUMOD_SR_DET7_Pos)) /* Assigment of value for DET7 in the SECUMOD_SR register */
#define SECUMOD_SR_Msk                        _UINT32_(0x00FF0000)                                 /* (SECUMOD_SR) Register Mask  */

#define SECUMOD_SR_DET_Pos                    _UINT32_(16)                                         /* (SECUMOD_SR Position) PIOBU Intrusion Detector */
#define SECUMOD_SR_DET_Msk                    (_UINT32_(0xFF) << SECUMOD_SR_DET_Pos)               /* (SECUMOD_SR Mask) DET */
#define SECUMOD_SR_DET(value)                 (SECUMOD_SR_DET_Msk & (_UINT32_(value) << SECUMOD_SR_DET_Pos)) 

