Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/secumod.h
/* -------- SECUMOD_SCR : (SECUMOD Offset: 0x10) ( /W 32) Status Clear Register -------- */
#define SECUMOD_SCR_DET0_Pos                  _UINT32_(16)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET0_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET0_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET0(value)               (SECUMOD_SCR_DET0_Msk & (_UINT32_(value) << SECUMOD_SCR_DET0_Pos)) /* Assigment of value for DET0 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET1_Pos                  _UINT32_(17)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET1_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET1_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET1(value)               (SECUMOD_SCR_DET1_Msk & (_UINT32_(value) << SECUMOD_SCR_DET1_Pos)) /* Assigment of value for DET1 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET2_Pos                  _UINT32_(18)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET2_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET2_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET2(value)               (SECUMOD_SCR_DET2_Msk & (_UINT32_(value) << SECUMOD_SCR_DET2_Pos)) /* Assigment of value for DET2 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET3_Pos                  _UINT32_(19)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET3_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET3_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET3(value)               (SECUMOD_SCR_DET3_Msk & (_UINT32_(value) << SECUMOD_SCR_DET3_Pos)) /* Assigment of value for DET3 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET4_Pos                  _UINT32_(20)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET4_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET4_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET4(value)               (SECUMOD_SCR_DET4_Msk & (_UINT32_(value) << SECUMOD_SCR_DET4_Pos)) /* Assigment of value for DET4 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET5_Pos                  _UINT32_(21)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET5_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET5_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET5(value)               (SECUMOD_SCR_DET5_Msk & (_UINT32_(value) << SECUMOD_SCR_DET5_Pos)) /* Assigment of value for DET5 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET6_Pos                  _UINT32_(22)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET6_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET6_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET6(value)               (SECUMOD_SCR_DET6_Msk & (_UINT32_(value) << SECUMOD_SCR_DET6_Pos)) /* Assigment of value for DET6 in the SECUMOD_SCR register */
#define SECUMOD_SCR_DET7_Pos                  _UINT32_(23)                                         /* (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET7_Msk                  (_UINT32_(0x1) << SECUMOD_SCR_DET7_Pos)              /* (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET7(value)               (SECUMOD_SCR_DET7_Msk & (_UINT32_(value) << SECUMOD_SCR_DET7_Pos)) /* Assigment of value for DET7 in the SECUMOD_SCR register */
#define SECUMOD_SCR_Msk                       _UINT32_(0x00FF0000)                                 /* (SECUMOD_SCR) Register Mask  */

#define SECUMOD_SCR_DET_Pos                   _UINT32_(16)                                         /* (SECUMOD_SCR Position) PIOBU Intrusion Detector */
#define SECUMOD_SCR_DET_Msk                   (_UINT32_(0xFF) << SECUMOD_SCR_DET_Pos)              /* (SECUMOD_SCR Mask) DET */
#define SECUMOD_SCR_DET(value)                (SECUMOD_SCR_DET_Msk & (_UINT32_(value) << SECUMOD_SCR_DET_Pos)) 

/* -------- SECUMOD_RAMRDY : (SECUMOD Offset: 0x14) ( R/ 32) RAM Access Ready Register -------- */
#define SECUMOD_RAMRDY_READY_Pos              _UINT32_(0)                                          /* (SECUMOD_RAMRDY) Ready for system access flag Position */
#define SECUMOD_RAMRDY_READY_Msk              (_UINT32_(0x1) << SECUMOD_RAMRDY_READY_Pos)          /* (SECUMOD_RAMRDY) Ready for system access flag Mask */
#define SECUMOD_RAMRDY_READY(value)           (SECUMOD_RAMRDY_READY_Msk & (_UINT32_(value) << SECUMOD_RAMRDY_READY_Pos)) /* Assigment of value for READY in the SECUMOD_RAMRDY register */
#define SECUMOD_RAMRDY_Msk                    _UINT32_(0x00000001)                                 /* (SECUMOD_RAMRDY) Register Mask  */


/* -------- SECUMOD_PIOBU : (SECUMOD Offset: 0x18) (R/W 32) PIO Backup Register -------- */
#define SECUMOD_PIOBU_PIOBU_AFV_Pos           _UINT32_(0)                                          /* (SECUMOD_PIOBU) PIOBU Alarm Filter Value Position */
#define SECUMOD_PIOBU_PIOBU_AFV_Msk           (_UINT32_(0xF) << SECUMOD_PIOBU_PIOBU_AFV_Pos)       /* (SECUMOD_PIOBU) PIOBU Alarm Filter Value Mask */
#define SECUMOD_PIOBU_PIOBU_AFV(value)        (SECUMOD_PIOBU_PIOBU_AFV_Msk & (_UINT32_(value) << SECUMOD_PIOBU_PIOBU_AFV_Pos)) /* Assigment of value for PIOBU_AFV in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_PIOBU_RFV_Pos           _UINT32_(4)                                          /* (SECUMOD_PIOBU) PIOBUx Reset Filter Value Position */
#define SECUMOD_PIOBU_PIOBU_RFV_Msk           (_UINT32_(0xF) << SECUMOD_PIOBU_PIOBU_RFV_Pos)       /* (SECUMOD_PIOBU) PIOBUx Reset Filter Value Mask */
#define SECUMOD_PIOBU_PIOBU_RFV(value)        (SECUMOD_PIOBU_PIOBU_RFV_Msk & (_UINT32_(value) << SECUMOD_PIOBU_PIOBU_RFV_Pos)) /* Assigment of value for PIOBU_RFV in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_OUTPUT_Pos              _UINT32_(8)                                          /* (SECUMOD_PIOBU) Configure I/O Line in Input/Output Position */
#define SECUMOD_PIOBU_OUTPUT_Msk              (_UINT32_(0x1) << SECUMOD_PIOBU_OUTPUT_Pos)          /* (SECUMOD_PIOBU) Configure I/O Line in Input/Output Mask */
#define SECUMOD_PIOBU_OUTPUT(value)           (SECUMOD_PIOBU_OUTPUT_Msk & (_UINT32_(value) << SECUMOD_PIOBU_OUTPUT_Pos)) /* Assigment of value for OUTPUT in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_PIO_SOD_Pos             _UINT32_(9)                                          /* (SECUMOD_PIOBU) Set/Clear the I/O Line when configured in Output Mode (OUTPUT =1) Position */
#define SECUMOD_PIOBU_PIO_SOD_Msk             (_UINT32_(0x1) << SECUMOD_PIOBU_PIO_SOD_Pos)         /* (SECUMOD_PIOBU) Set/Clear the I/O Line when configured in Output Mode (OUTPUT =1) Mask */
#define SECUMOD_PIOBU_PIO_SOD(value)          (SECUMOD_PIOBU_PIO_SOD_Msk & (_UINT32_(value) << SECUMOD_PIOBU_PIO_SOD_Pos)) /* Assigment of value for PIO_SOD in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_PIO_PDS_Pos             _UINT32_(10)                                         /* (SECUMOD_PIOBU) Level on the Pin in Input Mode (OUTPUT = 0) (Read-only) Position */
#define SECUMOD_PIOBU_PIO_PDS_Msk             (_UINT32_(0x1) << SECUMOD_PIOBU_PIO_PDS_Pos)         /* (SECUMOD_PIOBU) Level on the Pin in Input Mode (OUTPUT = 0) (Read-only) Mask */
#define SECUMOD_PIOBU_PIO_PDS(value)          (SECUMOD_PIOBU_PIO_PDS_Msk & (_UINT32_(value) << SECUMOD_PIOBU_PIO_PDS_Pos)) /* Assigment of value for PIO_PDS in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_PULLUP_Pos              _UINT32_(12)                                         /* (SECUMOD_PIOBU) Programmable Pull-up State Position */
#define SECUMOD_PIOBU_PULLUP_Msk              (_UINT32_(0x3) << SECUMOD_PIOBU_PULLUP_Pos)          /* (SECUMOD_PIOBU) Programmable Pull-up State Mask */
#define SECUMOD_PIOBU_PULLUP(value)           (SECUMOD_PIOBU_PULLUP_Msk & (_UINT32_(value) << SECUMOD_PIOBU_PULLUP_Pos)) /* Assigment of value for PULLUP in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_SCHEDULE_Pos            _UINT32_(14)                                         /* (SECUMOD_PIOBU) Pull-up/Down Scheduled Position */
#define SECUMOD_PIOBU_SCHEDULE_Msk            (_UINT32_(0x1) << SECUMOD_PIOBU_SCHEDULE_Pos)        /* (SECUMOD_PIOBU) Pull-up/Down Scheduled Mask */
#define SECUMOD_PIOBU_SCHEDULE(value)         (SECUMOD_PIOBU_SCHEDULE_Msk & (_UINT32_(value) << SECUMOD_PIOBU_SCHEDULE_Pos)) /* Assigment of value for SCHEDULE in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_SWITCH_Pos              _UINT32_(15)                                         /* (SECUMOD_PIOBU) Switch State for Intrusion Detection Position */
#define SECUMOD_PIOBU_SWITCH_Msk              (_UINT32_(0x1) << SECUMOD_PIOBU_SWITCH_Pos)          /* (SECUMOD_PIOBU) Switch State for Intrusion Detection Mask */
#define SECUMOD_PIOBU_SWITCH(value)           (SECUMOD_PIOBU_SWITCH_Msk & (_UINT32_(value) << SECUMOD_PIOBU_SWITCH_Pos)) /* Assigment of value for SWITCH in the SECUMOD_PIOBU register */
#define SECUMOD_PIOBU_Msk                     _UINT32_(0x0000F7FF)                                 /* (SECUMOD_PIOBU) Register Mask  */


