Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/secumod.h
#define SECUMOD_BMPR_DET_Pos                  _UINT32_(16)                                         /* (SECUMOD_BMPR Position) PIOBU Intrusion Detector Protection */
#define SECUMOD_BMPR_DET_Msk                  (_UINT32_(0xFF) << SECUMOD_BMPR_DET_Pos)             /* (SECUMOD_BMPR Mask) DET */
#define SECUMOD_BMPR_DET(value)               (SECUMOD_BMPR_DET_Msk & (_UINT32_(value) << SECUMOD_BMPR_DET_Pos)) 

/* -------- SECUMOD_NMPR : (SECUMOD Offset: 0x80) (R/W 32) Normal Mode Protection Register -------- */
#define SECUMOD_NMPR_DET0_Pos                 _UINT32_(16)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET0_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET0_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET0(value)              (SECUMOD_NMPR_DET0_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET0_Pos)) /* Assigment of value for DET0 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET1_Pos                 _UINT32_(17)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET1_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET1_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET1(value)              (SECUMOD_NMPR_DET1_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET1_Pos)) /* Assigment of value for DET1 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET2_Pos                 _UINT32_(18)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET2_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET2_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET2(value)              (SECUMOD_NMPR_DET2_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET2_Pos)) /* Assigment of value for DET2 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET3_Pos                 _UINT32_(19)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET3_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET3_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET3(value)              (SECUMOD_NMPR_DET3_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET3_Pos)) /* Assigment of value for DET3 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET4_Pos                 _UINT32_(20)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET4_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET4_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET4(value)              (SECUMOD_NMPR_DET4_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET4_Pos)) /* Assigment of value for DET4 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET5_Pos                 _UINT32_(21)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET5_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET5_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET5(value)              (SECUMOD_NMPR_DET5_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET5_Pos)) /* Assigment of value for DET5 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET6_Pos                 _UINT32_(22)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET6_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET6_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET6(value)              (SECUMOD_NMPR_DET6_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET6_Pos)) /* Assigment of value for DET6 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_DET7_Pos                 _UINT32_(23)                                         /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_NMPR_DET7_Msk                 (_UINT32_(0x1) << SECUMOD_NMPR_DET7_Pos)             /* (SECUMOD_NMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_NMPR_DET7(value)              (SECUMOD_NMPR_DET7_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET7_Pos)) /* Assigment of value for DET7 in the SECUMOD_NMPR register */
#define SECUMOD_NMPR_Msk                      _UINT32_(0x00FF0000)                                 /* (SECUMOD_NMPR) Register Mask  */

#define SECUMOD_NMPR_DET_Pos                  _UINT32_(16)                                         /* (SECUMOD_NMPR Position) PIOBU Intrusion Detector Protection */
#define SECUMOD_NMPR_DET_Msk                  (_UINT32_(0xFF) << SECUMOD_NMPR_DET_Pos)             /* (SECUMOD_NMPR Mask) DET */
#define SECUMOD_NMPR_DET(value)               (SECUMOD_NMPR_DET_Msk & (_UINT32_(value) << SECUMOD_NMPR_DET_Pos)) 

/* -------- SECUMOD_NIEPR : (SECUMOD Offset: 0x84) ( /W 32) Normal Interrupt Enable Protection Register -------- */
#define SECUMOD_NIEPR_DET0_Pos                _UINT32_(16)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET0_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET0_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET0(value)             (SECUMOD_NIEPR_DET0_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET0_Pos)) /* Assigment of value for DET0 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET1_Pos                _UINT32_(17)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET1_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET1_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET1(value)             (SECUMOD_NIEPR_DET1_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET1_Pos)) /* Assigment of value for DET1 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET2_Pos                _UINT32_(18)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET2_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET2_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET2(value)             (SECUMOD_NIEPR_DET2_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET2_Pos)) /* Assigment of value for DET2 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET3_Pos                _UINT32_(19)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET3_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET3_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET3(value)             (SECUMOD_NIEPR_DET3_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET3_Pos)) /* Assigment of value for DET3 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET4_Pos                _UINT32_(20)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET4_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET4_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET4(value)             (SECUMOD_NIEPR_DET4_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET4_Pos)) /* Assigment of value for DET4 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET5_Pos                _UINT32_(21)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET5_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET5_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET5(value)             (SECUMOD_NIEPR_DET5_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET5_Pos)) /* Assigment of value for DET5 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET6_Pos                _UINT32_(22)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET6_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET6_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET6(value)             (SECUMOD_NIEPR_DET6_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET6_Pos)) /* Assigment of value for DET6 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_DET7_Pos                _UINT32_(23)                                         /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Position */
#define SECUMOD_NIEPR_DET7_Msk                (_UINT32_(0x1) << SECUMOD_NIEPR_DET7_Pos)            /* (SECUMOD_NIEPR) PIOBU Intrusion Detector Protection Interrupt Enable Mask */
#define SECUMOD_NIEPR_DET7(value)             (SECUMOD_NIEPR_DET7_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET7_Pos)) /* Assigment of value for DET7 in the SECUMOD_NIEPR register */
#define SECUMOD_NIEPR_Msk                     _UINT32_(0x00FF0000)                                 /* (SECUMOD_NIEPR) Register Mask  */

#define SECUMOD_NIEPR_DET_Pos                 _UINT32_(16)                                         /* (SECUMOD_NIEPR Position) PIOBU Intrusion Detector Protection Interrupt Enable */
#define SECUMOD_NIEPR_DET_Msk                 (_UINT32_(0xFF) << SECUMOD_NIEPR_DET_Pos)            /* (SECUMOD_NIEPR Mask) DET */
#define SECUMOD_NIEPR_DET(value)              (SECUMOD_NIEPR_DET_Msk & (_UINT32_(value) << SECUMOD_NIEPR_DET_Pos)) 

/* -------- SECUMOD_NIDPR : (SECUMOD Offset: 0x88) ( /W 32) Normal Interrupt Disable Protection Register -------- */
#define SECUMOD_NIDPR_DET0_Pos                _UINT32_(16)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET0_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET0_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET0(value)             (SECUMOD_NIDPR_DET0_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET0_Pos)) /* Assigment of value for DET0 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET1_Pos                _UINT32_(17)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET1_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET1_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET1(value)             (SECUMOD_NIDPR_DET1_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET1_Pos)) /* Assigment of value for DET1 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET2_Pos                _UINT32_(18)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET2_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET2_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET2(value)             (SECUMOD_NIDPR_DET2_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET2_Pos)) /* Assigment of value for DET2 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET3_Pos                _UINT32_(19)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET3_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET3_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET3(value)             (SECUMOD_NIDPR_DET3_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET3_Pos)) /* Assigment of value for DET3 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET4_Pos                _UINT32_(20)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET4_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET4_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET4(value)             (SECUMOD_NIDPR_DET4_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET4_Pos)) /* Assigment of value for DET4 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET5_Pos                _UINT32_(21)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET5_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET5_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET5(value)             (SECUMOD_NIDPR_DET5_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET5_Pos)) /* Assigment of value for DET5 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET6_Pos                _UINT32_(22)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET6_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET6_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET6(value)             (SECUMOD_NIDPR_DET6_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET6_Pos)) /* Assigment of value for DET6 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_DET7_Pos                _UINT32_(23)                                         /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Position */
#define SECUMOD_NIDPR_DET7_Msk                (_UINT32_(0x1) << SECUMOD_NIDPR_DET7_Pos)            /* (SECUMOD_NIDPR) PIOBU Intrusion Detector Protection Interrupt Disable Mask */
#define SECUMOD_NIDPR_DET7(value)             (SECUMOD_NIDPR_DET7_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET7_Pos)) /* Assigment of value for DET7 in the SECUMOD_NIDPR register */
#define SECUMOD_NIDPR_Msk                     _UINT32_(0x00FF0000)                                 /* (SECUMOD_NIDPR) Register Mask  */

#define SECUMOD_NIDPR_DET_Pos                 _UINT32_(16)                                         /* (SECUMOD_NIDPR Position) PIOBU Intrusion Detector Protection Interrupt Disable */
#define SECUMOD_NIDPR_DET_Msk                 (_UINT32_(0xFF) << SECUMOD_NIDPR_DET_Pos)            /* (SECUMOD_NIDPR Mask) DET */
#define SECUMOD_NIDPR_DET(value)              (SECUMOD_NIDPR_DET_Msk & (_UINT32_(value) << SECUMOD_NIDPR_DET_Pos)) 

