Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_serial_flash/firmware/src/packs/ATSAMA5D29_DFP/component/secumod.h
/** \brief SECUMOD register offsets definitions */
#define SECUMOD_CR_REG_OFST            _UINT32_(0x00)      /* (SECUMOD_CR) Control Register Offset */
#define SECUMOD_SYSR_REG_OFST          _UINT32_(0x04)      /* (SECUMOD_SYSR) System Status Register Offset */
#define SECUMOD_SR_REG_OFST            _UINT32_(0x08)      /* (SECUMOD_SR) Status Register Offset */
#define SECUMOD_SCR_REG_OFST           _UINT32_(0x10)      /* (SECUMOD_SCR) Status Clear Register Offset */
#define SECUMOD_RAMRDY_REG_OFST        _UINT32_(0x14)      /* (SECUMOD_RAMRDY) RAM Access Ready Register Offset */
#define SECUMOD_PIOBU_REG_OFST         _UINT32_(0x18)      /* (SECUMOD_PIOBU) PIO Backup Register Offset */
#define SECUMOD_PIOBU0_REG_OFST        _UINT32_(0x18)      /* (SECUMOD_PIOBU0) PIO Backup Register Offset */
#define SECUMOD_PIOBU1_REG_OFST        _UINT32_(0x1C)      /* (SECUMOD_PIOBU1) PIO Backup Register Offset */
#define SECUMOD_PIOBU2_REG_OFST        _UINT32_(0x20)      /* (SECUMOD_PIOBU2) PIO Backup Register Offset */
#define SECUMOD_PIOBU3_REG_OFST        _UINT32_(0x24)      /* (SECUMOD_PIOBU3) PIO Backup Register Offset */
#define SECUMOD_PIOBU4_REG_OFST        _UINT32_(0x28)      /* (SECUMOD_PIOBU4) PIO Backup Register Offset */
#define SECUMOD_PIOBU5_REG_OFST        _UINT32_(0x2C)      /* (SECUMOD_PIOBU5) PIO Backup Register Offset */
#define SECUMOD_PIOBU6_REG_OFST        _UINT32_(0x30)      /* (SECUMOD_PIOBU6) PIO Backup Register Offset */
#define SECUMOD_PIOBU7_REG_OFST        _UINT32_(0x34)      /* (SECUMOD_PIOBU7) PIO Backup Register Offset */
#define SECUMOD_JTAGCR_REG_OFST        _UINT32_(0x68)      /* (SECUMOD_JTAGCR) JTAG Protection Control Register Offset */
#define SECUMOD_SCRKEY_REG_OFST        _UINT32_(0x70)      /* (SECUMOD_SCRKEY) Scrambling Key Register Offset */
#define SECUMOD_RAMACC_REG_OFST        _UINT32_(0x74)      /* (SECUMOD_RAMACC) RAM Access Rights Register Offset */
#define SECUMOD_RAMACCSR_REG_OFST      _UINT32_(0x78)      /* (SECUMOD_RAMACCSR) RAM Access Rights Status Register Offset */
#define SECUMOD_BMPR_REG_OFST          _UINT32_(0x7C)      /* (SECUMOD_BMPR) Backup Mode Protection Register Offset */
#define SECUMOD_NMPR_REG_OFST          _UINT32_(0x80)      /* (SECUMOD_NMPR) Normal Mode Protection Register Offset */
#define SECUMOD_NIEPR_REG_OFST         _UINT32_(0x84)      /* (SECUMOD_NIEPR) Normal Interrupt Enable Protection Register Offset */
#define SECUMOD_NIDPR_REG_OFST         _UINT32_(0x88)      /* (SECUMOD_NIDPR) Normal Interrupt Disable Protection Register Offset */
#define SECUMOD_NIMPR_REG_OFST         _UINT32_(0x8C)      /* (SECUMOD_NIMPR) Normal Interrupt Mask Protection Register Offset */
#define SECUMOD_WKPR_REG_OFST          _UINT32_(0x90)      /* (SECUMOD_WKPR) Wakeup Protection Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SECUMOD register API structure */
typedef struct
{
  __O   uint32_t                       SECUMOD_CR;         /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SECUMOD_SYSR;       /**< Offset: 0x04 (R/W  32) System Status Register */
  __I   uint32_t                       SECUMOD_SR;         /**< Offset: 0x08 (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       SECUMOD_SCR;        /**< Offset: 0x10 ( /W  32) Status Clear Register */
  __I   uint32_t                       SECUMOD_RAMRDY;     /**< Offset: 0x14 (R/   32) RAM Access Ready Register */
  __IO  uint32_t                       SECUMOD_PIOBU[8];   /**< Offset: 0x18 (R/W  32) PIO Backup Register */
  __I   uint8_t                        Reserved2[0x30];
  __IO  uint32_t                       SECUMOD_JTAGCR;     /**< Offset: 0x68 (R/W  32) JTAG Protection Control Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  uint32_t                       SECUMOD_SCRKEY;     /**< Offset: 0x70 (R/W  32) Scrambling Key Register */
  __IO  uint32_t                       SECUMOD_RAMACC;     /**< Offset: 0x74 (R/W  32) RAM Access Rights Register */
  __IO  uint32_t                       SECUMOD_RAMACCSR;   /**< Offset: 0x78 (R/W  32) RAM Access Rights Status Register */
  __IO  uint32_t                       SECUMOD_BMPR;       /**< Offset: 0x7C (R/W  32) Backup Mode Protection Register */
  __IO  uint32_t                       SECUMOD_NMPR;       /**< Offset: 0x80 (R/W  32) Normal Mode Protection Register */
  __O   uint32_t                       SECUMOD_NIEPR;      /**< Offset: 0x84 ( /W  32) Normal Interrupt Enable Protection Register */
  __O   uint32_t                       SECUMOD_NIDPR;      /**< Offset: 0x88 ( /W  32) Normal Interrupt Disable Protection Register */
  __I   uint32_t                       SECUMOD_NIMPR;      /**< Offset: 0x8C (R/   32) Normal Interrupt Mask Protection Register */
  __IO  uint32_t                       SECUMOD_WKPR;       /**< Offset: 0x90 (R/W  32) Wakeup Protection Register */
} secumod_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_SECUMOD_COMPONENT_H_ */
